1s/ERP/Conf/Catalogs/Лико_ПравилаПеремещенияТМЦ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Лико_ПравилаПеремещенияТМЦ</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выключить</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приоритет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>11</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СложнаяНастройка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборНастройки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаПравил</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстСообщения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Стратегия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_СтратегииПеремещенияТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Лико_ДействияПоПравилуПеремещенияТМЦ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Исключить</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:EnumRef.Лико_ПараметрыВыдачиНоменклатурыВПроизводство</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

1s/ERP/Conf/Catalogs/Лико_ПравилаПеремещенияТМЦ/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ПрограммныйИнтерфейс

Процедура ПередЗаписью(Отказ)
	
	
	
	Если ЗначениеЗаполнено(Родитель.Организация) Тогда
		
		Организация = Родитель.Организация;
		
	КонецЕсли;
	
	
	Если ЭтоГруппа=Истина Тогда
		
		Наименование=СтрШаблон("%1 (%2)",ВидНоменклатуры.Наименование, Организация);
	Иначе
		
		Если Приоритет=0 Или Родитель<>Ссылка.Родитель Тогда
			Приоритет=Справочники.Лико_ПравилаПеремещенияТМЦ.ПолучитьПриоритетМакс(ВидНоменклатуры, Организация)+1;
		КонецЕсли;
		
		Если Не СложнаяНастройка Тогда
			
			Описание="";
			ЕстьДанные=Ложь;
			Для каждого ДопРеквизит Из ДополнительныеРеквизиты Цикл
				Если ЗначениеЗаполнено(ДопРеквизит.Значение) ТОгда	
					ЕстьДанные=Истина;
					Описание=Описание+" " +ДопРеквизит.Свойство.Наименование+ ?(ДопРеквизит.Исключить," <> "," = ")+Строка(ДопРеквизит.Значение)+";";	
				КонецЕсли;	
			КонецЦикла;
			Если ЕстьДанные Тогда
				Описание=Лев(Описание,СтрДлина(Описание)-1);
			КонецЕсли;
		КонецЕсли;
		Наименование=СтрШаблон("%4 - %1 %2 (%3)",Строка(ВидНоменклатуры),Описание, Организация, Код);
		
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
    МассивНепроверяемыхРеквизитов.Добавить("Организация"); 	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	
	Если Не ЭтоГруппа Тогда 
		Если Не ДополнительныеСвойства.Свойство("Записан") Тогда
			
			ДополнительныеСвойства.Вставить("Записан", Истина);	
			Записать();
			
		КонецЕсли;
		
		Справочники.Лико_ПравилаПеремещенияТМЦ.СохранитьНастройкуПравил(ВидНоменклатуры,Организация);
		
	КонецЕсли;


КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Приоритет = 0;
	НастройкиОбъектаКопирования = ОбъектКопирования.ОтборНастройки.Получить();
	ОтборНастройки =  Новый ХранилищеЗначения(НастройкиОбъектаКопирования, Новый СжатиеДанных(9)); 
	
КонецПроцедуры


#КонецОбласти




#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.';
						|en = 'Invalid object call on the client.'");
#КонецЕсли
